app/controllers/tasks_controller.rb

	def new
		@task = Task.new
		@tasks = Task.all
---
SELECT "tasks".* FROM "tasks"

	def create
		@task = Task.new(params[:task].permit(:name))
		if @task.save
---
INSERT INTO "tasks" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-12-22 23:12:20.495092"], ["name", "dafad"], ["updated_at", "2014-12-22 23:12:20.495092"]]